{
  "0": {
	"sun_collector": ["Jump over the gaps, get the Sun Fragment (the yellow thing).", 
	"If you fall down, use the input displayed above to restart the level.", 
	"Exit the level while holding the Sun Fragment (the yellow thing)."],
	
	"the_water": ["Whenever you collect an orb, it turns into an ability that you can use.", 
	"Press the ability button to jump in the air. Each ability usage requires collecting an orb.", 
	"You can use your abilities multiple times without falling to the ground."],
	
	"floating_island": ["Try different approaches to the climb. Remember that the undo button makes mistakes less costly.", 
	"Using one ability to get one ability is a terrible trade if you are not making any progress.", 
	"Get double Water from the right and climb on the left."],
	
	"the_air": ["Air lets you dash horizontally, but you don't need it for everything.", 
	"Jump over the first pit to save one Air. Undo or restart if you fall down.",
	"Not much else to say. Remember that pancakes are pretty good."],
	
	"powers_combined": ["The most recently collected ability will be used first. You can't swap the order.", 
	"You have to use Air first. How? Figure it out (or use the last hint).", 
	"Jump over the Air orb to collect Water first."],
	
	"elemental_stack": ["The most recently collected ability will be used first.", 
	"The order of use is opposite to the order of collection, it works like a stack.", 
	"Get Air, then Water, then Air, then Water. Use them to ascend."]
  },

  "1": {
	"sharp_reefs": ["The red stuff are spikes. You cannot cross the spike tunnel with Water.", 
	"You can jump over the pit on the right. Get Air with double Water.", 
	"No need to be too cautious when dashing through a spike tunnel, it's \"lenient\", as they say."],
	
	"trade_offer": ["Using Air to get Air does nothing.", 
	"Water seems a bit useless in this level, while Air is much needed.", 
	"You can use Water to increase your jump distance. Get Air with Water."],
	
	"the_copy": ["The green orb gives you a copy of the next element you will use (if there is any).",
	"You need two Water abilities to get back to the entrance.",
	"Don't collect the last green orb with Air as your top ability."],
	
	"reverse_thinker": ["Remember, you have to collect the orbs in reverse order.",
	"You only need one Water, plan when you need it.",
	"Get both of the green orbs last."],
	
	"extra_piece": ["You have one more orb than you need.", 
	"You only need one Water and three Air to get to the Sun Fragment.", 
	"Get the green orb first, you don't need it."],
	
	"sandcastle": ["You need two Water orbs to get the Sun Fragment.", 
	"You don't have to collect every single orb on the left before going for the Sun Fragment.", 
	"Get three Water and go for the Sun Fragment."],
	
	"elemental_stack_v2": ["You must use four abilities in quick succession before landing on the ground.", 
	"Air, Water, Water, Air.", 
	"Complete collection order: Air, Air, Water, Water, Air, Water."],
	
	"reckless_fall": ["Finish the level just like the previous one.", 
	"The green orbs are a bait.", 
	"Dodge the stacked Water orbs on your way down."],
	
	"doors_and_keys": ["The crystals are Charges. They require a touch of elemental energy. The gates open when you activate a number of charges displayed on them.", 
	"You activate the Charges by touching them while using an ability. If a gate has \"4\" on it, it will open when 4 charges are lit.", 
	"After using any ability, you start leaving a trail that continues until the ability is finished. Touch Charges in that state."],
	
	"in_charge": ["You always activate Charges while using an ability. This happens even when the ability is almost finished.", 
	"Activate the rightmost Charge last.", 
	"With Air, you can clear gaps and activate Charges at the same time."],
	
	"over_the_ditch": ["A closed gate acts as a solid block.", 
	"Use the gate on the left to your advantage, don't open it too early.", 
	"Jump and dash from the gate to clear the gap."],
	
	"energy_conservation": ["Collecting orbs during an ability won't stop you from activating Charges.", 
	"Some gates shall remain unopened.", 
	"You should use Air to activate the leftmost Charge."],
	
	"assassin": ["Collect everything on the left at the start.", 
	"You can activate more than one Charge with one ability.", 
	"Activate the two middle Charges with one Air at the end."],
	
	"stalactite": ["Sometimes Charges are the obstacle.", 
	"Leave the green orb on the left for later.", 
	"Avoid the Charge when going up with Water."],
	
	"missing_piece": ["The upper path is useless.", 
	"If you use an ability and go through a copy orb, the next one will be copied.", 
	"With enough Water you can reach the Sun Fragment from the bottom."],
	
	"reckless_squeeze": ["Don't collect the Water orbs when going down.", 
	"Use the wall to squeeze on the left side of the stacked Water orbs.", 
	"Hold left against the wall to collect and use the Air to cross the gap from the right."]
  },

  "2": {
	"the_earth": ["Earth will always make you go down to the ground, before launching you up. You can't chain it.", 
	"Earth gives you less height than Water, but more than a jump.",
	"Use Earth to climb up from the right."],
	
	"portable_trampoline": ["You have way more Earth than you need to traverse.",
	"Water needs to be at the bottom of the stack so don't collect more Earth than you need.",
	"To get the Water, you should get two Earth orbs from the higher ground."],
	
	"two_birds": ["Earth activates Charges when you fly down towards the ground.", 
	"Use only Air and Earth to activate all four Charges.", 
	"Copy the Air."],
	
	"brown_burden": ["You need a lot of Air.", 
	"You have to use green orbs on Air only.", 
	"Leave one Earth on the bottom before going up."],
	
	"leap_of_faith": ["You have to copy Air.", 
	"Save your starting Air by jumping onto the platform that has Earth and Air on it.", 
	"Use the Earth to activate the Charge and jump back up at the same time."],
	
	"devious_platform": ["Don't activate all three Charges. It will never work.", 
	"Activating the leftmost Charge is inevitable, but you cannot activate the same Charge twice.", 
	"Activate the leftmost Charge with Air and ignore the middle one."],
	
	"step_by_step": ["Collect only as many orbs as you need to activate one Charge. Come back and repeat.", 
	"Duplicate Air.", 
	"Use the Earth orb from the left corridor first."],
	
	"concept_is_baffling": ["Leave the Water untouched until the very end.", 
	"If you use Earth while Airborne over an orb, you will collect it and still bounce.", 
	"Copy the Earth, so you can do the previously mentioned trick on Air and Water."],
	
	"later_usage": ["Copy Air, and activate the leftmost Charge with it. Save the Earth for triple activation.", 
	"Leave only one of the bottom Water orbs untouched. You will need it to get back up at the end.", 
	"Start by collecting Earth and Air. Don't collect the upper Water orb until you've activated the leftmost Charge."],
	
	"the_shaft": ["You don't have to use Earth to activate Charges in the shaft. You can use two other elements.", 
	"Use Water and Air to activate Charges in the shaft.", 
	"Collect and use the Water immediately."],
	
	"burden_for_eternity": ["The Charge at the top is a bait.", 
	"Quick fingers can save you from certain death.", 
	"Use Air to cancel Earth momentum and avoid spikes."],
	
	"usage_of_useless": ["The bottom Air orb is the last one you collect on the left side. Earth is the second to last.", 
	"See the hole to the right of the portal? At some point you will have to go down the hole, activate the Charge, and get back up... somehow.", 
	"At some point you will have to jump off of a moving object. It's quite evil."]
  },

  "3": {
	"the_fire": ["Fire makes you shoot a clone projectile that steadily moves in one direction. You teleport to it when it hits a wall or a room border.", 
	"The clone you shoot activates all of the Charges it touches.",
	"Go right first. Don't move while the clone is flying."],
	
	"ambush": ["Both Air and Fire have their limits. Use both to activate each Charge.", 
	"You need Air to go right and avoid spikes.",
	"Use Fire to go left first."],
	
	"burglary": ["Activating one Charge is good. Activating two is bad.", 
	"Don't go right with Fire. Use it in a different way.", 
	"Use Fire to activate the first Charge by shooting it left instead of right."],
	
	"order_problem": ["You are free to move and do whatever you want when the Fire clone is flying.", 
	"Use Air to get to the left. Use Water to activate the Charge on the right.",
	"Collect the Water orb after using Fire, but before the clone hits a wall."],
	
	"quick_act": ["You need the Earth orb to get back up, so don't collect it before collecting the Sun Fragment.", 
	"If you are holding a Sun Fragment when you teleport, it will teleport with you.", 
	"Use Fire to teleport back, and quickly get the Sun Fragment with Water before you teleport."],
	
	"fun_moment": ["Save the first Water until the very end.", 
	"Activate the leftmost Charge with Fire.", 
	"If you use Earth when airborne over an orb, you will collect it and still bounce."],
	
	"optionless": ["Get Earth and Air, and use them to activate the leftmost Charge.", 
	"Your clone cannot collect orbs for you.", 
	"Collect the remaining orbs in reverse order using Fire."],
	
	"blue_herring": ["The Water orb on the left is a bait. You should never collect it.", 
	"There are more ways to activate one of the Charges on the right than using Water.", 
	"Use Earth and Fire to activate the rightmost Charge."],
	
	"bypass": ["Earth is better than Water in this level.", 
	"You can use Earth to go up, without activating anything.", 
	"Start by collecting all of the Water. Copy Fire and Earth."],
	
	"return_ticket": ["You need Earth to get Fire.",
	"Air has no real use here, so you can activate stuff with it.", 
	"Don't collect the Water in the middle until you have Fire."],
	
	"abandoned_marketplace": ["Getting two orbs for one is a good trade to start with.",
	"You can use Water and Air to get to the Fire.", 
	"Don't collect the free Air until you're about to go for the Earth."],
	
	"theft": ["You need to do something with quite a precise timing here.",
	"You can have more than one clone flying at a time. All of them will teleport you.", 
	"Use the second Fire when the first clone is about to hit the goal."],
	
	"not_my_problem": ["Use Fire to activate the leftmost Charge.",
	"Use Air to activate the rightmost Charge.", 
	"The Water is a bait. Don't ever go left."],
	
	"bruh_moment": ["You need to use fancy movement tech to solve this level. I'm sorry.",
	"Whenever you use Fire, it gives you a backward boost, which is just enough to get you through a short spike tunnel.", 
	"To make it easier: Hold right, jump, and when you are about to touch the spikes, release right and tap left and the ability button all at the same time."]
  },

  "4": {
	"forward_thinker": ["Thanks to the new orb you, don't need to think in reverse!",
	"The reverse orb reverses the order of your elements.",
	"Get Water first and Earth last."], 

	"inversion": ["You need Fire to get to the left.",
	"When you get to the left, you will need: Earth, Air, and Earth (in that order).",
	"Remember that you can shoot the Fire before collecting everything."], 

	"extraction": ["Reverse orbs allow you to acquire elements from tricky places by putting them in the back.",
	"Earth combined with Water allows you to get to reach higher vertically.",
	"Two Water between Earth works, because it will be split after collecting Fire as a side effect."], 

	"cancellation": ["You need to split Water orbs. You can use a reverse orb for this.",
	"You technically have one more Earth orb than you need.",
	"Start by collecting one Earth, and then leave one Water to collect it later."], 

	"indifference": ["You need Earth, Fire, and Water to complete the chamber on the right.",
	"If your abilities are symmetrical, collecting a reverse orb will do nothing to them.",
	"Remove one of the bottom reverse orbs without affecting your abilities as soon as possible. Activate the leftmost charge with Water."], 

	"the_split": ["The Charges have to be activated with one ability. It must be the Fire.",
	"You need Air to return from the right side, so you cannot use it to go there, because it cannot be split. Duplicate the Fire.",
	"Splitting double Fire is possible by using one of them and collecting the reverse orb."], 

	"parity": ["Technically, you only need four abilities, but you have five orbs at your disposal.",
	"You can only get to the Sun Fragment with Fire and only get back with Air. These abilities need to be placed next to each other.",
	"Fire lets you pass through orbs without collecting them."], 

	"right_order": ["Order gates open when you use the displayed elements in the correct order. If a wrong ability is used at any point, it will reset.",
	"At the start, just collect everything and go through the level normally. Watch how gates react when you use abilities.",
	"Remember that the order of usage is: top-left, top-right, bottom-left, bottom-right (it's not going in a circle)."],

	"wrong_order": ["You can jump over the Fire orb right next to you.",
	"Ignore the upper gate. It should remain closed.",
	"Fire lets you pass through orbs without collecting them."],

	"forcing_unnecessary": ["You can progress both gates at once if the next required element is the same for both of them.",
	"Use one Earth to simultaneously open the gate on the left and progress the gate on the right.",
	"Copy Water whenever possible. You don't need to copy anything but Water."],

	"forcing_impossible": ["The rightmost Air orb is a bait. Don't ever go there.",
	"Throughout the whole level, you use Water only once.",
	"To get on the ledge on the left, you have to use one Earth and two Air abilities."],

	"hard_to_reach": ["Reach the Air orb with Earth and Water.",
	"Use the first Air orb only to progress the gates.",
	"Collect Water and Earth while the clone is flying."],

	"interruption": ["You have to open the gate to complete the level.",
	"Resetting order gates is sometimes good. Reset it early, so it doesn't reset too late.",
	"Use the Air to reset the gate after going right, so it sets up perfectly after you come back."],

	"telepathy": ["If you use Earth twice, the gates will reset to the beginning state.",
	"You have one more green orb at the top than you need. Do you remember the previous level?",
	"Copy and use Earth at the very start, so it sets up a beneficial reset."],

	"waste_disposal": ["Start by collecting Water and Earth to escape at the end. Sometimes collecting abilities is bad because it can force a bad gate reset.",
	"The bottom-right copy orb is problematic. Getting another Water forces a bad reset. Maybe you can get rid of it somehow?",
	"The bottom-right copy orb will be the first one to be used. The rest will be used to copy Air."]
  },

  "5": {
	"one_way": ["The thin platforms only allow for movement in one way. There are tiny arrows on their sides to help indicate the direction.",
	"After collecting the Sun Fragment, two Water abilities is all you need.",
	"Get Air and duplicate Earth to get Water. Earth followed by Air is enough to clear the gap."], 
	
	"out_of_ordinary": ["You can activate two Charges on the left with one Air.",
	"Use Air followed by Water to make it through the tunnel on the right.",
	"Activate two Charges on the left right before completing the level."], 
	
	"out_of_bounds": ["You need to get under the level somehow. When you do, you will only need one Air to win.",
	"The rightmost Air is a bait. Don't ever go to the section on the right.",
	"If a gate would crush you, but you are on a one-way platform, you will pass right through it."], 
	
	"dig_yourself_out": ["Use Earth and Air to get onto the ledge blocked by the leftmost gate.",
	"Duplicate Earth.",
	"Use Water to activate the bottom-right Charge."], 
	
	"get_buried_alive": ["Duplicate Water.",
	"If you teleport while you are using a different ability, the ability won't stop.",
	"Activate all of the Charges (except for the one near the portal) with just one Earth."],
	
	"the_escapist": ["Use Water creatively.",
	"Use only Earth and Fire to get to the upper ledge.",
	"You can use Water to cross the horizontal gap, because there is no ceiling above it."],
	
	"mouse_trap": ["You can have more than one clone flying at a time. All of them will teleport you.",
	"Both clones should go in the same direction.",
	"Fire two clones from the right, so both Charges activate at the same time."],
	
	"weaver": ["Water and Earth are definitely useful in this level.",
	"You can use Earth and Water to get over the obstacles.",
	"Use Earth, Water, and Fire to go to the right from above."],
	
	"loop": ["Activate both Charges with Earth.",
	"Duplicate Air.",
	"Collect and use Fire right before activating a Charge and collecting Water."],
	
	"indiana_zoe": ["The Water element indicator is correct on both sides.",
	"The only element you should duplicate is Water.",
	"Use Air to activate the leftmost Charge and escape the trap."],
	
	"the_love": ["The heart-shaped element is Love.",
	"Love can activate Charges.",
	"Keep collecting and duplicating Love whenever possible, but start using it at the very end."],
	
	"resolving_issues": ["The only element you should duplicate is Love. You need it to open the gate.",
	"Use Fire and Water to get through the tunnel.",
	"Get the Air before going left. You will need it to come back. The reverse orb allows you to take Love with you."],
	
	"ignoring_issues": ["You need to use Air to get to the left side. The problem is with how you are going to get back using Fire.",
	"The Love stalls you mid-air upon use. It also resets your momentum.",
	"You can't use only Love to get back right, but you can use it to stall for something to happen."],
	
	"complications": ["Use Love to activate all of the Charges.",
	"Use Air to cross all of the gaps on the left.",
	"Collect and use the Love on the right first. It's much more constrained than the one on the left."],
	
	"guilt_tripping": ["Get Earth as late as possible.",
	"You can put Love in between Water to prevent activating the gate on the right.",
	"You can put two Love in between Water to prevent activating the gate on the right and activate the one on the left at the same time."],
	
	"love_bombing": ["Collecting reverse orbs doesn't reset gates.",
	"Get two Love before going up.",
	"Use the second Love pair immediately after getting it."],
	
	"you_need_it": ["Use the Fire from the ledge on the left to open the order gate, and then activate all the Charges.",
	"You need four Air to go back and forth through the tunnel on the right twice.",
	"Love is the only element that can reset the order gate at the right time. Go for it at the very start."],
	
	"love_gives_wings": ["Yeah, you can cross short spike tunnels with a single Love. You will have to do that three times.",
	"Use one Air to activate both Charges.",
	"Leave the Water orb for later. Leave activating the Charges for later, too."]
  },

  "6": { 
	"elevator": ["The gate moves back and forth with each ability usage.",
	"Use Love to move the gate back and forth to get up.",
	"Don't collect Water until you have the Sun Fragment."], 
	
	"incompetence": ["There is pretty much nothing in this level that Water can do that Earth can't.",
	"Only copy the Earth.",
	"Use Water immediately. Its only use is to move the gate downwards."], 
	
	"inertia": ["The gate takes plenty of time to move to its destination.", 
	"If you use an element while a gate is moving, it will start going back immediately.", 
	"Use Earth immediately after using Love."], 
	
	"retaker": ["You can salvage one Water or one Love from this level. You will need Water to get to the next level.", 
	"After the gate that's closest to you takes you up, you can get to the Sun Fragment with just one Water.", 
	"If you want to salvage Water, copy it whenever possible. Use Love to move the gate back and forth to get up."], 
	
	"greatest_deal": ["You can salvage one Earth or one Air from this level. You will need Earth to get to the next level.", 
	"To salvage Earth, just grab one and complete the level. You will need Air to get to the level 6, so don't worry about it until then.", 
	"To salvage Air, you need to get the middle Earth as soon as possible."], 
	
	"onset": ["You need to collect every single orb in this level.", 
	"Collect and copy Water at the start.", 
	"If you use Earth while Airborne over an orb, you will collect it and still bounce."], 
	
	"offset": ["Air and Earth are useless.", 
	"Double Fire can achieve sneaky stuff. Remember the first bonus level in world 3?",
	"The gate can push your Fire clone down to clear the gap. You will need to set up another one to get back, though."], 
	
	"quest_for_fire": ["The next step after this level is to get the letter \"Z\". You can only do it with Fire.", 
	"Copy Fire.", 
	"Use Water to activate the bottom-right Charge, but do not get up the ledge."], 
	
	"compound": ["The Water element indicator is correct. You need to use Water to get up.", 
	"Collect Air before activating the Charge.", 
	"Use Air to activate the Charge and escape the trap."], 
	
	"fight_the_movement": ["There is no point in the whole level where you want to carry more than one Fire ability at the same time.", 
	"Use one Air for the sole purpose of moving a gate. There is more than one way to do that, so explore the possibilities.", 
	"Go to the left before ever going to the right."]
  },

  "H": {
	"the_first_finale": ["You can activate the bottom left Charge with Air without going through the spike tunnel.", 
	"The green orb in the bottom-left corner shall be collected last.",
	"The solution requires you to use Fire... three times in a row."],
	
	"elemental_shell": [],
	
	"salvation": []
  }
}
