{
  "0": {
	"0": ["Exit the level while holding the Sun Fragment."],
	"1": ["Press the ability button to jump in the air. Each ability usage requires collecting an orb."],
	"2": ["Get abilities on the right and climb on the left."],
	"3": ["Air lets you dash. Jump over the first pit to save one air."],
	"4": ["The most recently collected ability will be used first.", "Jump over the air orb to collect water first."],
	"5": ["The order of use is opposite to the order of collection.", "Think about the order in which you need the abilities, and then collect them in reverse order."]
  },

  "1": {
	"0": ["Spikes hurt, you should avoid them.", "You cannot cross the spike tunnel with water.", "Jump over the spike gap, get the air using water."],
	"1": ["You can use the water for something other than what you are used to.", "Get air first, double jump with water to get another air."],
	"2": ["Green orbs copy your current top element.", "Don't collect the last green orb before using air, you don't need two air orbs."],
	"3": ["Think in reverse, plan when you need the water.", "Get both of the green orbs last."],
	"4": ["You have one more orb than you need.", "Get the green orb first, you don't need it."],
	"5": ["You need two water orbs to get the Sun Fragment.", "You don't have to collect every single orb on the left before going for the Sun Fragment.", "Get three water and go for the Sun Fragment."],
	"6": ["You have to use four abilities before landing on the ground.", "Air, water, water, air.", "Complete collection order: air, air, water, water, air, water."],
	"7": ["Finish the level just like the previous one.", "The green orbs are a bait", "Dodge the stacked water orbs on your way down."],
	"A": ["You activate the charges by touching them while using an ability.", "Activate the rightmost charge last."],
	"B": ["Use the gate on the left to your advantage, don't open it too early.", "Jump and dash from the gate to clear the gap."],
	"C": ["Some gates shall remain unopened.", "You should use air to activate the leftmost charge."],
	"D": ["You can activate more than one charge with one ability.", "Activate the two middle charges with one air at the end."],
	"E": ["Leave the green orb on the left for later.", "Avoid the charge when going up with water."],
	"4S": ["The upper path is useless.", "If you use an ability and go through a copy orb, the next one will be copied."],
	"7S": ["Use the wall to squeeze on the left side of the stacked water orbs.", "Hold left to collect and use the air to cross the gap from the right."]
  },

  "2": {
	"0": ["Earth will always make you go down to the ground before launching you up. You can't chain it.", "Earth gives you less height than water, but more than a jump. Use it to climb up from the right."],
	"1": ["You have way more earth than you need to traverse. Make sure water is at the bottom of the stack.", "Don't collect more earth than you need so that it can be used as soon as you collect it.", "To get the water, you should get two earths from the higher ground."],
	"2": ["Earth activates charges when you fly down towards the ground.", "Use only air and earth to activate all four charges."],
	"3": ["You must use green orbs on air only.", "Leave one earth on the bottom before going up."],
	"4": ["Save your starting air by jumping onto the platform that has earth and air on it.", "Use the earth to activate the charge and jump back up at the same time."],
	"5": ["Don't activate all three charges, it will never work.", "Activating the leftmost charge is inevitable, but you cannot activate the same charge twice.", "Activate the leftmost charge with air and ignore the middle one."],
	"6": ["Collect only as many orbs as you need to activate one charge. Come back and repeat.", "Duplicate air.", "Use the earth orb from the left corridor first."],
	"7": ["Leave the water untouched until the very end.", "If you use earth while airborne over an orb, you will collect it and still bounce.", "Copy the earth so you can do the previously mentioned trick on air and water."],
	"8": ["Activate the leftmost charge with air.", "Leave one of the bottom water orbs untouched, you will need it to get back up.", "Don't collect the rightmost water until you've activated the leftmost charge. Start by collecting earth and air."],
	"9": ["You don't have to use earth to activate charges in the shaft. You can use two other elements.", "Use your water immediately. I mean it."],
	"3S": ["The charge at the top is a bait.", "Quick fingers can save you from certain death."],
	"8S": ["The bottom air orb is the last one you collect on the left side. Earth is the second to last.", "See the hole to the right of the portal? At some point you will have to go down the hole, activate the charge, and get back up... somehow.", "At some point you will have to jump off of a moving object. It's quite evil."]
  },

  "3": {
	"0": ["Fire makes you shoot a clone projectile that steadily moves in one direction. You teleport to it when it hits a wall or a room border.", "Go right first."],
	"1": ["Both air and fire have their limits. Use both to get each charge.", "You need air to go right and avoid spikes so use fire to go left first."],
	"2": ["Activating charges is bad sometimes.", "You must activate one charge only. Going right with fire will not work.", "You don't need the first fire orb for movement, so use it to activate the charge by shooting left."],
	"3": ["You are free to move and do whatever you want when your clone is flying.", "Collect the water orb after using fire, but before the clone hits a wall."],
	"4": ["You need the earth orb to get back up, don't collect it before collecting the Sun Fragment.", "If you are holding a Sun Fragment when you teleport, it will teleport with you.", "Get water first and then copy fire.", "Use fire and quickly get the Sun Fragment with water."],
	"5": ["Save the first water until the very end.", "Activate the leftmost charge with fire.", "If you use earth when airborne over an orb, you will collect it and still bounce."],
	"6": ["Get earth and air, and use them to activate the leftmost charge.", "Your clone cannot collect orbs for you.", "Use fire to collect the remaining orbs in reverse order."],
	"7": ["The water orb on the left is a bait", "There are more ways to activate one of the charges on the right than using water.", "Use earth and fire to activate the rightmost charge."],
	"A": ["Earth is better than water in this level. You can use it to go up without activating anything.", "Start by collecting all of the water. Copy fire and earth."],
	"B": ["Air has no use other than to activate the charge in the middle.", "Don't collect the water in the middle until you have fire."],
	"C": ["You can use water and air to get to the fire.", "Don't collect the free air until you're about to go for the earth."],
	"2S": ["You can have more than one clone flying at once. All of them will teleport you", "Use the second fire when the first clone is about to hit the Red Fragment."],
	"3S": ["The water is a bait. Don't ever go left.", "Use air to activate the rightmost charge.", "You can exit a level while your clone is still flying."],
	"5S": ["Whenever you use fire, it gives you a backward boost, which is just enough to get you through a short spike tunnel. I'm sorry.", "To make it easier: Hold right, jump, and when you are about to touch the spikes, release right and tap left and the ability button all at the same time."]
  },

  "H": {
	"A": ["You can activate the bottom left charge without going through the spike tunnel.", "The solution requires you to use fire... three times in a row."],
	"B": ["You should wishlist the game.", "It would also be nice if you shared it around."]
  }
}
